Revit 2026 API

# FabricationUtils Class

---

General utility methods in the Autodesk Revit MEP product for fabrication.

SystemObject Autodesk.Revit.DB.FabricationFabricationUtils

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FabricationUtils
```
```vb
Public NotInheritable Class FabricationUtils
```
```cpp
public ref class FabricationUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FabricationUtils = class end
```

The FabricationUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportToPCF |  |
|  | ValidateConnectivity | Check if two connectors are valid to connect directly without couplings. |

#### Reference

Autodesk.Revit.DB.Fabrication Namespace